{
    "Document Title": "Community Workforce Agreement for the Prado Road Interchange and Public Safety Center Projects",
    "Department": "Public Works Department, City Attorney's Office",
    "Cost Center": "N/A",
    "Agenda Date": "05/03/2022",
    "Estimated Time": "N/A",
    "Authors": "Shelly Stanwyck, Deputy City Manager, Michael Codron, Deputy City Manager",
    "Subject": "Based on the context provided, the subject of the document appears to be a Community Workforce Agreement (CWA) between the City of San Luis Obispo and various unions and contractors for construction projects in the city.",
    "Recommendation": "Here are the key recommendations outlined in the document:

    Staff should continue dialogue with the Trades Council for the Prado Road Interchange and Public Safety Center projects to determine if progress could be made on the open issues. The document notes that staff re-engaged with the Trades Council after this recommendation and were ultimately able to reach a tentative agreement.
    
    The negotiated Community Workforce Agreement (CWA) includes provisions to allow local (San Luis Obispo-based) non-union contractors to directly employ up to 3 initial "core workers" before using the union referral system. After 3 core workers, local contractors can employ 1 core worker for each union referral up to a max of 7 core workers.
    
    The CWA includes provisions to allow unions to prioritize referral of local residents to covered projects rather than following normal referral procedures based on an out-of-work list. This will help maximize local employment opportunities.
    
    The CWA includes a goal of 50% local worker participation on covered projects.
    
    The CWA designates trade unions as the exclusive source of craft labor on covered projects and requires union referral systems to be used exclusively to obtain craft labor, with the exceptions noted above for core workers.
    
    Staff should continue to dialogue with the Trades Council for the Prado Road Interchange and Public Safety Center projects to determine if progress could be made on the open issues.
    
    The Cultural Arts District Parking Structure project would not be included in the CWA in order to remain on schedule, due to substantive differences on significant issues.
    
    Staff should re-engage with the Trades Council to reach consensus on the outstanding issues for the Prado Road Interchange and Public Safety Center projects.
    
    The City Attorney’s office should form a negotiating team comprised of the City Attorney, outside labor relations experts, and City staff.
    
    The deadline for the City to reach an agreement with the Trades Council is July 19, 2022 for the Prado Road Interchange and Public Safety Center projects.
    
    In summary, the key recommendations focused on reaching agreement with the Trades Council on a CWA that preserves some flexibility for local contractors while maximizing local hiring opportunities. The tentative agreement appears to have incorporated these recommendations.",
    "Discussion": " Here is a detailed discussion on the Community Workforce Agreement for the Prado Road Interchange and Public Safety Center projects in San Luis Obispo:

    Background:
    
    The City of San Luis Obispo has major infrastructure projects planned, including the Prado Road Interchange and a new Public Safety Center. As part of these projects, the City aims to promote local hiring and career opportunities.
    Plan Overview:
    
    The City is considering a Community Workforce Agreement (CWA) with the Tri-Counties Building and Construction Trades Council. This would be a project labor agreement setting hiring goals and terms for the Prado and Public Safety Center projects.
    Goals:
    
    Prioritize hiring of local workers, especially veterans, women, people of color and the formerly incarcerated.
    Support workforce development and create career pathways into construction trades.
    Ensure efficient, on-time, and high-quality construction for these public projects.
    Key Elements:
    
    Sets goals for hiring local residents, veterans, women, and apprentices.
    Allows unions to refer local workers.
    Requires joint labor-management training programs.
    Establishes dispute resolution procedures and work rules.
    Allows specialty work to be excluded from CWA coverage.
    Public Engagement:
    
    Extensive outreach conducted with unions, contractors, community groups.
    City Council provided feedback and approved CWA negotiation objectives.
    CWA aligns with City goals for equity, economic development, and community workforce partnerships."



}